{
  "postData": [
    {
      "title": "U.S. to Review Social Media Posts of Student and Scholar Visa Applicants",
      "author": "By Edward Wong",
      "image": "https://static01.nyt.com/images/2025/06/18/multimedia/18dc-student-visas-hbfl/18dc-student-visas-hbfl-superJumbo.jpg?quality=75&auto=webp",
      "content": "The State Department plans to review the social media accounts of foreign citizens who apply for student and visiting scholar visas as it resumes processing those applications.\n\nApplicants will be screened for perceived “hostility” toward the United States, and they will be asked to make their social media accounts “public” for the review,  State Department officials said on Wednesday.\n\nAll applications for F, M and J nonimmigrant visas, which are for scholarly exchanges and research, will be reviewed, the officials said.\n\nConsular officers at missions overseas are being told to look for “any indications of hostility toward the citizens, culture, government, institutions or founding principles of the United States.” The State Department did not provide further details on how officers would define that criteria.\n\nThe agency issued the guidelines after halting the processing of student and visiting scholar visas for nearly a month.\n\nThe new policy appears to be the latest prong in the Trump administration’s broad assault on universities, which is focused on trying to tamp down liberal thought at the institutions. Some of President Trump’s aides say American universities need to embrace more conservative ideas and people.\n\nThe guidance’s vague parameters will no doubt create much uncertainty among American universities and students and scholars overseas who intend to travel to the United States.\n\nCritics say the review process and other related actions on visas by Secretary of State Marco Rubio are aimed at stifling free speech, promoting ideological conformity and coercing foreign citizens to censor themselves and refrain from criticizing the Trump administration.\n\nMany U.S. universities ask foreign students to pay full tuition, which makes up a substantial portion of the schools’ annual revenues. On some campuses, foreign students are the majority of researchers in certain disciplines, especially in the sciences.\n\nForeign students collectively pursued more than 1.3 million degrees in higher education in 2023, according to a report by the Department of Homeland Security.\n\nProfessors visiting from abroad, who are also affected by the new restrictions, often play important teaching and research roles at many American universities.\n\nA State Department spokesperson said in an email in mid-March that “all available technology” was being used to screen visa applicants and visa holders. The spokesperson was replying to a question from The New York Times about whether the department was using artificial intelligence to scan databases and social media posts to find people who, in the eyes of Trump aides, should have their visas revoked.\n\n“I think we are very worried that this is going to be some political litmus test that’s going to be applied to students,” said Sarah Spreitzer, the vice president of the American Council on Education. “I don’t believe that’s ever happened before. Obviously we’re going to see how it’s going to be applied.”\n\nMr. Rubio issued a cable on March 25 that told consular officers to scrutinize the social media content of some applicants for student and other types of visas.\n\nEditors’ Picks\n\nA Totally Spontaneous Expression of Joy, Contractually Sponsored by Moët & Chandon\n\nMarlee Matlin on Hollywood, Healing and Stories Still Untold\n\nWhy You Should Wait to Renovate\nHe sent another cable to embassies and consulates on May 27, ordering them to halt interviews  for student and visiting scholar visas until State Department headquarters could come up with new guidelines for reviewing applicants’ social media accounts.\n\nMr. Rubio has also said that the State Department would target visas held by Chinese students. He announced on May 28 that the Trump administration would work to “aggressively revoke” visas of Chinese students, including those with ties to the Chinese Communist Party or who are studying in “critical fields.” He and the department have given no further details.\n\nSeparately, the Trump administration tried this spring to end foreign student enrollment at Harvard University as part of its attack on that school. The State Department stopped processing visas for foreign students, scholars and other foreign visitors planning to go to Harvard, but the agency told overseas missions on June 9 to resume the processing after a judge prohibited the administration from adopting the ban.\n\nIn recent months, Mr. Rubio has spoken about canceling various student visas, revoking permanent residency status (“green cards”) and scrutinizing the social media history of foreign visitors, often in the context of outrage around Israel’s war campaign in Gaza. He has said pro-Palestinian protesters on campuses have harassed other students, destroyed property and disrupted daily life, even though those acts have not been widespread across university protests.\n\nMr. Rubio told reporters in late March that he had revoked 300 or more visas, many of which were issued to students, and was continuing to cancel more daily.\n\nIn early March, Mr. Rubio stripped permanent residency status from Mahmoud Khalil, a recent graduate of Columbia University who had been a student activist. Mr. Rubio said Mr. Khalil, who has Palestinian heritage and is married to an American citizen, was undermining U.S. foreign policy. Immigration agents then arrested Mr. Khalil.\n\nIn some cases, the foreign citizens at risk of losing their visas or green cards have brought cases against the U.S. government, and judges have issued temporary restraining orders on federal actions.\n\nStephanie Saul contributed reporting from New York.",
      "date": "2025-06-21T14:00:49.041Z",
      "id": 1,
      "likes": 4,
      "views": 1
    },
    {
      "title": "Kenya reaffirms digital prowess with top wins at Huawei ICT competition",
      "author": "by BOSCO MARITA",
      "image": "https://cms.eu-central-1.linodeobjects.com/image/2025/06/1e53a5d3-de50-41f0-8b91-06834c3a078e.jpeg",
      "content": "Kenya has reaffirmed its digital prowess by bagging four top prizes at the Huawei Information Communication and Technology (ICT) Competition Global Final 2024–2025 held in Shenzhen, China.\n\nThe awards, which showcased the country’s growing strength in ICT education and innovation, were won by 12 public university students who competed against some of the most talented learners from around the world.\n\nHuawei Kenya Deputy Chief Executive Officer Stephen Zhang said the competition offered students a platform to showcase their skills in areas such as Artificial Intelligence, Cloud, and Networking.\n\nHe noted that Kenyan students have consistently excelled on the global stage, and the latest wins are proof of the country’s readiness to lead and compete in the international digital space.\n\nAmong the awards secured during the global finals was a first prize in the Computing Track by a team made up of students from Jomo Kenyatta University of Agriculture and Technology (JKUAT) and Machakos University.\n\n Another combined team from Machakos University, JKUAT, and the University of Nairobi won second place in the Network Track.\n\nA joint team from JKUAT and Moi University took second place in the Cloud Track category, while the Silicon Savannah team from Egerton University walked away with third place in the Innovation Track.\n\nZhang explained that Kenya’s participation in the competition was part of a broader national strategy to strengthen digital skills and close the gap between academia and the job market.\n\nSpeaking at Parliament Buildings in Nairobi, where National Assembly Speaker Moses Wetang’ula hosted the winning team, Zhang stressed that digital transformation is rapidly reshaping industries across the world.\n\nHe pointed out that the biggest challenge amid this shift is the shortage of skilled ICT professionals. He said initiatives like the global competition and the Huawei ICT Academy are helping to empower the next generation of innovators, ensuring that talent development keeps pace with technological advancement.\n\nZhang also revealed that Kenya had fielded an all-girls team in China this year—a significant step forward in promoting gender inclusion in the fields of Science, Technology, Engineering, and Mathematics.\nSpeaker Wetang’ula led a recognition ceremony organised by Huawei Kenya in collaboration with public universities and government partners to honour the 12 students for their exemplary performance on the global stage.\n\nHe congratulated the learners and urged them to keep striving for excellence in ICT and to use their skills to develop solutions that can make a real impact both in Kenya and globally.\n\n“Keep on pushing forward and leverage emerging fields to create practical solutions for Kenya and the world,” Wetang’ula advised.\n\nOne of the winners, Mark Omaiko, a second-year student of Cloud Computing and Information Security at Machakos University, said the entire team was proud to have placed Kenya on the global map as an ICT powerhouse. He encouraged other students to take advantage of similar programs to test their skills, gain international exposure, and proudly represent the country.",
      "date": "2025-06-21T14:10:22.263Z",
      "id": 2,
      "likes": 3,
      "views": 2
    },
    {
      "title": "Iran rules out new nuclear talks until attacks stop",
      "author": "Rachel Muller-Heyndyk & Sofia Ferreira Santos",
      "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/200c/live/1a448850-4e29-11f0-96b9-0f1e4cc8a578.jpg.webp",
      "content": "Iran has said it will not resume talks over its nuclear programme while under attack, hours after Israel's defence minister warned of a \"prolonged\" conflict with the Islamic Republic.\n\nForeign Minister Abbas Araghchi on Friday met European diplomats in Geneva who urged him to revive diplomatic efforts with the US over his country's nuclear programme.\n\nThe Israeli army's chief of staff Eyal Zamir said in a video address that his country should be ready for a \"prolonged campaign\".\n\nFighting has raged into the night with the Israeli military announcing a new wave of attacks against Iranian missile storage and launch sites after Iran launched missiles towards central Israel.\n\nExplosions were heard close to Tel Aviv, with missile interceptions visible over Israel's second-largest city. Reports say a building was set on fire in central Israel by falling shrapnel.\n\nMeanwhile, a 16-year-old was killed and two others were injured in a Israeli strike on the city of Qom, south of Tehran, Iranian state media reported early on Saturday.\n\nThey reported Israeli strikes also again targeted a nuclear facility in the city of Isfahan.\n\nLive coverage\nOn Friday, Araghchi said Iran was ready to consider diplomacy only once Israel's \"aggression is stopped\".\n\nIran's nuclear programme was peaceful, he insisted, and Israel's attacks violated international law. Iran, he added, would continue to \"exercise its legitimate right of self-defence\".\n\n\"I make it crystal clear that Iran's defence capabilities are non-negotiable,\" he said.\n\nAraghchi is set to attend another round of talks on Saturday, in Istanbul, with representatives of the Arab League over the weekend.\n\nIsrael's ambassador to the UN accused Iran of having a \"genocidal agenda\" and posing an ongoing threat, adding that Israel would not stop targeting nuclear facilities until they were \"dismantled\".\n\nIn an interview with German newspaper Bild published on Saturday, Israeli Foreign Minister Gideon Sa'ar said his country had set back Iran's nuclear capabilities by at least two years.\n\nHe added that strikes would continue.\nUS President Donald Trump said Iran had a \"maximum\" of two weeks to avoid possible American air strikes, suggesting that he could take a decision before the 14-day deadline he set on Thursday.\n\n\"I'm giving them a period of time, and I would say two weeks would be the maximum,\" Trump told reporters.\n\nThe aim, he said, was to \"see whether or not people come to their senses\".\n\nThe US president was also dismissive of the Geneva talks between Araghchi and foreign ministers from the UK, France, Germany and the EU.\n\n\"Iran doesn't want to speak to Europe,\" Trump said. \"They want to speak to us. Europe is not going to be able to help in this.\"\n\nUK Foreign Secretary David Lammy said that the US had provided a \"short window of time\" to resolve the crisis in the Middle East which was \"perilous and deadly serious\".\n\nFrench Foreign Minister Jean-Noel Barrot said the ministers had invited the Iranian minister to \"consider negotiations with all sides, including the United States, without awaiting the cessation of strikes\".\n\nBarrot added that there could be \"no definitive solution through military means to the Iran nuclear problem\" and warned that it was \"dangerous to want to impose a regime change\" in Iran.\n\nIsrael was also hit by a new round of Iranian strikes on Friday with the Israeli military reporting an attack of 20 missiles targeting Haifa.\n\nOne Israeli woman died of a heart attack, bringing the Israeli death toll since the conflict began to 25.\n\nThe Israel Defense Forces said they had attacked ballistic missile storage and launch sites in western Iran.\n\nOver the past week, Israeli air strikes have destroyed Iranian military facilities and weapons, and killed senior military commanders and nuclear scientists.\n\nIran's health ministry said on Sunday that at least 224 people had been killed, while a human rights group, the Human Rights Activists News Agency, put the unofficial death toll at 657 on Friday.\n\nIsrael launched strikes in Iran on 13 June, leading to several rounds of Iranian missile and drone attacks on Israel.",
      "date": "2025-06-21T15:47:15.734Z",
      "id": 3,
      "likes": 3,
      "views": 2
    },
    {
      "title": "South Africa beat Australia in WTC final to net first major title",
      "author": "Source: Al Jazeera and news agencies",
      "image": "https://www.aljazeera.com/wp-content/uploads/2025/06/GettyImages-2219378860-1749909126.jpg?resize=770%2C513&quality=80",
      "content": "South Africa have secured their first major title by beating defending champions Australia by five wickets in the final of the World Test Championship at Lord’s Cricket Ground in London.\n\nThe Proteas knocked off the remaining 29 runs they needed before lunch on Saturday – sealing the win with more than a day and a half to spare, and sparking emotional celebrations in front of a packed crowd.\nThey moved from a portentous 213-2 overnight to 282-5, the second-highest successful run chase in the 141-year Rest history at the self-proclaimed home of cricket.\n\nAustralia did not give up the WTC mace easily, relentlessly attacking the stumps and pressuring a South Africa side with an infamous history of blowing winning positions on big ICC stages.\n\nBut South Africa was staunch and composed, only three boundaries in more than two hours, and lost only three wickets on Saturday in an air of inevitability.\n\n“We’ve come a long way as a team, as a country,” an emotional Keshav Maharaj said. “We always say we want to be good people and play good. We’re moving in the right direction as a cricketing nation.\n\nReferencing South Africa’s last title of any kind, the 1998 ICC Champions Trophy, Maharaj fought back tears in adding, “After 27 years of pain, to finally get over the line is super emotional. We’re so grateful to have Temba (Bavuma, captain) to get us over the line.\n\n“Diversity is our strength, so to see the crowd, they stand for the meaning of our rainbow nation. To lift the trophy is going to unite the nation even more.”\nThe desperate Australians used up all of their three reviews in vain within the first 90 minutes, but fought to the end. They took the new ball but were still blunted by a flat pitch.\nThe opener resumed the day on 102 and was out for 136 when only six more runs were needed. He spent six hours, 23 minutes in the middle.\n\nAbout 15 minutes later, Kyle Verreynne broke the tension by hitting the winning run, a drive into the covers.\n\nMarkram and captain Temba Bavuma set up the victory with an unbeaten and chanceless partnership of 143 runs the day before. They could not finish what they started, adding only four runs together before Bavuma edged Pat Cummins behind for 66, one more than he had overnight.\n\nTristan Stubbs was castled on 8 by Mitchell Starc with 41 runs needed and South Africa was too close to the finish to be denied.\n\nBut Markram could not have the pleasure himself. With six runs needed to win, he was caught at midwicket by Travis Head off Josh Hazlewood.\n\nAustralia did not celebrate. Instead, players slapped Markram on the back and congratulated him on his match-winning knock as the Lord’s crowd stood and applauded.\n\nThey stood again when the end finally came, a rout of red-hot Australia with five sessions to spare.\n\nSouth Africa’s history on the ICC’s biggest stages has been infamously cruel. The venues and dates of their most heart-breaking losses include Birmingham 1999, Dhaka 2011, Auckland 2015, Kolkata 2023 and Bridgetown 2024.\n\nBut London 2025 will go down as one of the greatest days in South African sport, when its cricket underdogs grabbed the advantage and did not let go against one of the great Australia Test sides to seal the title that ranks alongside the ICC’s Cricket World Cup and the T20 World Cup.\n\nSouth Africa were criticised before the final for its supposedly easier road — it did not face Australia or England in a series in the 2023-2025 WTC cycle — but it has won eight straight tests, its second-longest streak in history, and half of them away from home.",
      "date": "2025-06-22T08:21:52.030Z",
      "id": 5,
      "likes": 2
    },
    {
      "title": "Kenya police officer arrested over blogger’s death in custody",
      "author": "Source: Al Jazeera and news agencies",
      "image": "https://www.aljazeera.com/wp-content/uploads/2025/06/000_623Q88E-1749806316.jpg?resize=770%2C513&quality=80",
      "content": "A Kenyan police officer has been arrested in connection with the death of Albert Ojwang, a political blogger who died in police custody, in a case that has reignited anger over police abuse and triggered street protests in Nairobi.\n\nPolice spokesperson Michael Muchiri said on Friday that a constable had been taken into custody, the AFP news agency reported.\nHe did not give further information, referring queries to the Independent Policing Oversight Authority (IPOA), which is leading the investigation. There was no immediate comment from the IPOA.\n\nOjwang, 31, was declared dead on Sunday, two days after his arrest in the town of Homa Bay in western Kenya for allegedly criticising the country’s deputy police chief Eliud Lagat.\n\nThe police initially claimed Ojwang fatally injured himself by banging his head against a cell wall, but an autopsy revealed injuries that pathologists said were “unlikely to be self-inflicted”.\n\nThe government’s own pathologist found signs of blunt force trauma, neck compression and soft tissue injuries, suggesting an assault. Independent pathologist Bernard Midia, who assisted with the post-mortem, also ruled out suicide.\n\nAmid growing pressure, President William Ruto on Wednesday said Ojwang had died “at the hands of the police”, reversing earlier official accounts of his death.\n\nThe incident has added fuel to longstanding allegations of police brutality and extrajudicial killings in Kenya, particularly following last year’s antigovernment demonstrations. Rights groups say dozens were unlawfully detained after the protests, with some still unaccounted for.\n\nEarlier this week, five officers were suspended to allow for what the police described as a “transparent” inquiry.\n\nOn Thursday, protesters flooded the streets of the capital, waving Kenyan flags and chanting “Lagat must go”, demanding the resignation of the senior police official Ojwang had criticised.\n\nRuto on Friday pledged swift action and said that his administration would “protect citizens from rogue police officers”. While Ruto has repeatedly promised to end enforced disappearances and extrajudicial killings, human rights groups accuse his government of shielding security agencies from accountability.\n\nAccording to IPOA, 20 people have died in police custody in just the past four months. The death of Ojwang, a vocal online critic, has become a symbol of growing public frustration with unchecked police power.\n\nInternational pressure is mounting, with both the United States and European Union calling for a transparent and independent investigation into Ojwang’s death.",
      "date": "2025-06-22T08:32:56.478Z",
      "id": 6,
      "likes": 2
    }
  ]
}